# Setup
* Import and set dependencies

In [1]:
import pandas as pd

In [2]:
csvread = pd.read_csv("04-Pandas_Homework_HeroesOfPymoli_Resources_purchase_data.csv")

In [3]:
# Create DataFrame
df_main = pd.DataFrame(csvread)
df_main.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

# Player Count
 
* Display the total number of players

In [4]:
# Find Player Count
player_count = df_main["SN"].nunique()
player_count

576

# Purchasing Analysis (Total)
* Number of Unique Items
* Average Purchase Price
* Total Number of Purchases
* Total Revenue

In [5]:
# Find unique item count
unique_items_count = df_main["Item Name"].nunique()
unique_items_count

179

In [6]:
# Find average purchar Price
avg_purchase_price = df_main["Price"].mean()
avg_purchase_price

3.050987179487176

In [7]:
# Find total number of purchases
total_purchases = df_main["Purchase ID"].nunique()
total_purchases

780

In [8]:
#Find Total Revenue
total_revenue = df_main["Price"].sum()
total_revenue

2379.77

In [9]:
# Purchase Analysis
purchase_analysis_dict = [{'Number of Unique Items': unique_items_count,
                          'Average Price': avg_purchase_price,
                          'Total Revenue': total_revenue
                         }]
df_purch_analysis = pd.DataFrame(purchase_analysis_dict)
df_purch_analysis['Number of Unique Items'] = df_purch_analysis['Number of Unique Items'].map("${:,.2f}".format)
df_purch_analysis['Average Price'] = df_purch_analysis['Average Price'].map("${:,.2f}".format)
df_purch_analysis['Total Revenue'] = df_purch_analysis['Total Revenue'].map("${:,.2f}".format)
df_purch_analysis

  Average Price Number of Unique Items Total Revenue
0         $3.05                $179.00     $2,379.77

# Gender Demographics
 
* Percentage and Count of Male Players
* Percentage and Count of Female Players
* Percentage and Count of Other / Non-Disclosed

In [10]:
# Male Player Count
count_male_filter = df_main.loc[df_main["Gender"] == "Male"]
count_male = len(count_male_filter.groupby('SN').count())
count_male

484

In [11]:
# Male Player Percentage
percent_male = count_male / player_count
percent_male

0.8402777777777778

In [12]:
# Female Player Count
count_female_filter = df_main.loc[df_main["Gender"] == "Female"] 
count_female = len(count_female_filter.groupby('SN').count())
count_female

81

In [13]:
#Female Player Percentage
percent_female = count_female / player_count
percent_female

0.140625

In [14]:
# NonDisclosed Player Count
count_nondisclosed_filter = df_main.loc[(df_main["Gender"] != "Female") & (df_main["Gender"] != "Male")]
count_nondisclosed = len(count_nondisclosed_filter.groupby('SN').count())
count_nondisclosed

11

In [15]:
# NonDisclosed Player Percent
percent_nondisclosed = count_nondisclosed / player_count
percent_nondisclosed

0.019097222222222224

In [16]:
# Gender DemoGraphics
demo_dict = {'Total Count':{'Male':count_male,
                            'Female':count_female,
                            'Non Disclosed':count_nondisclosed},
             'Percentage of Players':{'Male':percent_male * 100,
                                      'Female':percent_female * 100,
                                      'Non Disclosed':percent_nondisclosed * 100}
            }
df_gender_demo = pd.DataFrame(demo_dict)
df_gender_demo['Percentage of Players'] = df_gender_demo['Percentage of Players'].map("{:.2f}".format)
df_gender_demo

               Total Count Percentage of Players
Female                  81                 14.06
Male                   484                 84.03
Non Disclosed           11                  1.91

# Purchasing Analysis (Gender)
* The below each broken by gender
    * Purchase Count
    * Average Purchase Price
    * Total Purchase Value
    * Average Purchase Total per Person by Gender

In [17]:
# Filter for male Players
filter_male = df_main.loc[df_main["Gender"] == "Male"]
filter_male.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [18]:
# Get Male Purchase Count
purchase_count_male = len(filter_male)
purchase_count_male

652

In [19]:
# Get total Price for Males
total_price_male = filter_male["Price"].sum()
total_price_male

1967.64

In [20]:
# Get average price for males
avg_price_male = total_price_male / purchase_count_male
avg_price_male

3.0178527607361967

In [21]:
# Group Males by SN
male_sn_group = filter_male.groupby("SN")

In [22]:
# Get sum of male prices
sum_price_male = male_sn_group["Price"].sum()
sum_price_male

SN
Adairialis76       2.28
Aeda94             4.91
Aela59             4.32
Aelaria33          1.79
Aelastirin39       7.29
Aelidru27          1.09
Aelin32            8.98
Aelly27            6.79
Aellynun67         3.74
Aellyria80         3.08
Aelollo59          5.63
Aenarap34          2.96
Aeral43            4.40
Aeral68            4.00
Aeral97            4.80
Aeralria27         4.09
Aeralstical35      2.96
Aeri84             1.61
Aerillorin70       3.33
Aerithnucal56      4.40
Aerithnuphos61     4.91
Aerithriaphos45    1.56
Aerithriaphos46    2.18
Aesri53            1.76
Aesty53            3.91
Aestysu37          5.38
Aesur96            2.21
Aesurstilis64      1.03
Aidai53            4.60
Aidai61            1.01
                   ...
Undirrala66        5.47
Undirrasta89       1.94
Undista85          3.45
Undjask33          1.10
Undjaskla97        5.32
Undosia27          3.77
Undosian34         8.30
Undotesta33        4.74
Yadacal26          6.54
Yadaisuir65        4.09
Yadam35            2.48
Yadanu52           2.38
Yadaphos40         5.35
Yalae81            6.69
Yalaeria91         1.06
Yaliru88           3.03
Yalo85             3.65
Yalostiphos68      4.40
Yarithllodeu72     3.75
Yarithrgue83       3.45
Yarithsurgue62     4.94
Yarolwen77         4.43
Yasrisu92          3.44
Yastyriaphos75     4.75
Yasur35            4.48
Yasur85            1.10
Yathecal72         3.46
Yathedeu43         6.02
Zhisrisu83         7.89
Zontibe81          8.03
Name: Price, Length: 484, dtype: float64

In [23]:
# Get average price for Males
avg_sn_price_male = sum_price_male.mean() 
avg_sn_price_male

4.06537190082645

In [24]:
filter_female = df_main.loc[df_main["Gender"] == "Female"]
filter_female.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [25]:
purchase_count_female = len(filter_female)
purchase_count_female

113

In [26]:
total_price_female = filter_female["Price"].sum()
total_price_female

361.94

In [27]:
avg_price_female = total_price_female / purchase_count_female
avg_price_female

3.203008849557522

In [28]:
female_sn_group = filter_female.groupby("SN")

In [29]:
sum_price_female = female_sn_group["Price"].sum()
sum_price_female

SN
Adastirin33         4.48
Aerithllora36       8.64
Aethedru70          3.54
Aidain51            3.45
Aiduesu86           4.48
Aillyrin83          2.89
Aisurdru79          3.51
Assilsan72          4.90
Assosia88           1.33
Baelollodeu94       9.03
Chadistaya75        3.94
Chamast86           2.05
Chamilsala65        8.55
Chamirrasya33       3.05
Chamjask73         13.83
Chanastsda67        3.70
Chanirra79          1.01
Chanjask65          4.32
Chanossast57        4.32
Errian63            3.49
Eudanu32            2.85
Eudanu84            1.02
Eusri70             7.34
Frichaststa61       1.79
Frichosia58         4.43
Frichosiala98       3.54
Haisurra41          4.40
Hari50              5.91
Heosurnuru52        4.46
Heudai45            3.47
                   ...
Phaedue89           3.85
Phaelap26           6.64
Pheosurllorin41     5.38
Phyali88           10.30
Quanrion96          3.08
Quanunwen42         3.49
Quilassa66          4.23
Reulae52            4.18
Reunasu60           8.82
Rithe53             3.39
Sally64             1.33
Sida61              5.43
Sondassasya91       3.81
Sondim68            5.66
Sondistanya61       3.45
Sundjask71          4.00
Syalollorap93       4.24
Syathe73            1.40
Taeduenu92          4.40
Tyaelistidru84      3.26
Tyaelly53           2.07
Tyaenasti87         4.40
Tyidaim51          11.83
Tyidainu31          2.49
Umolrian85          8.13
Wailin72            2.73
Yana46              3.55
Yarithrin84         4.14
Yathecal82          6.22
Yoishirrala98       4.58
Name: Price, Length: 81, dtype: float64

In [30]:
avg_sn_price_female = sum_price_female.mean() 
avg_sn_price_female

4.468395061728394

In [31]:
filter_nondisclosed = df_main.loc[(df_main["Gender"] != "Female") & (df_main["Gender"] != "Male")]
filter_nondisclosed.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [32]:
purchase_count_nondisclosed = len(filter_nondisclosed)
purchase_count_nondisclosed

15

In [33]:
total_price_nondisclosed = filter_nondisclosed["Price"].sum()
total_price_nondisclosed

50.19

In [34]:
avg_price_nondisclosed = total_price_nondisclosed / purchase_count_nondisclosed
avg_price_nondisclosed

3.3459999999999996

In [35]:
nondisclosed_sn_group = filter_nondisclosed.groupby("SN")

In [36]:
sum_price_nondisclosed = nondisclosed_sn_group["Price"].sum()
sum_price_nondisclosed

SN
Airi27          3.45
Chanosian48     7.52
Eodaisu60       3.94
Haerithp41      4.40
Idairin51       7.00
Jiskirran77     3.39
Lirtim36        1.33
Maluncil97      5.28
Rairith81       2.22
Siarithria38    6.91
Sundim98        4.75
Name: Price, dtype: float64

In [37]:
avg_sn_price_nondisclosed = sum_price_nondisclosed.mean() 
avg_sn_price_nondisclosed

4.5627272727272725

In [38]:
gender_purchase_analysis = {'Purchase Count':{'Male':purchase_count_male,
                                               'Female':purchase_count_female,
                                               'Non Disclosed':purchase_count_nondisclosed},
                             'Average Purchase Price':{'Male':avg_price_male,
                                                       'Female':avg_price_female,
                                                       'Non Disclosed':avg_price_nondisclosed},
                             'Total Purchase Value':{'Male':total_price_male,
                                                     'Female':total_price_female,
                                                     'Non Disclosed':total_price_nondisclosed},
                             'Average Total Purchase Per Person':{'Male':avg_sn_price_male,
                                                                  'Female':avg_sn_price_female,
                                                                  'Non Disclosed':avg_sn_price_nondisclosed}
                            }
df_gender_purchase_analysis = pd.DataFrame(gender_purchase_analysis)
df_gender_purchase_analysis['Average Purchase Price'] =df_gender_purchase_analysis['Average Purchase Price'].map("${:,.2f}".format)
df_gender_purchase_analysis['Total Purchase Value'] =df_gender_purchase_analysis['Total Purchase Value'].map("${:,.2f}".format)
df_gender_purchase_analysis['Average Total Purchase Per Person'] =df_gender_purchase_analysis['Average Total Purchase Per Person'].map("${:,.2f}".format)
df_gender_purchase_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase Per Person
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Non Disclosed,15,$3.35,$50.19,$4.56

# Age Demographics
* The below each broken into bins of 4 years (i.e. <10, 10-14, 15-19, etc.)
    * Purchase Count
    * Average Purchase Price
    * Total Purchase Value
    * Average Purchase Total per Person by Age Group

In [39]:
# Find Max for bins
df_main["Age"].max()

45

In [40]:
# Create Bins
bins = [0,9,14,19,24,29,34,39,50]

In [41]:
# Bin Names
group_names = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [42]:
# Cut
df_main["Age Category"] = pd.cut(df_main["Age"], bins, labels=group_names)
df_main.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Category
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [43]:
# Dedupe and Group Age Category
df_age_cat_unique = df_main[['SN','Age Category']].drop_duplicates()
df_age_cat_count = df_age_cat_unique.groupby('Age Category').count()
df_age_cat_count.to_dict()

{'SN': {'<10': 17,
  '10-14': 22,
  '15-19': 107,
  '20-24': 258,
  '25-29': 77,
  '30-34': 52,
  '35-39': 31,
  '40+': 12}}

In [44]:
# Add Percent of Players
df_age_cat_count['Percent of Players'] = df_age_cat_count['SN']/player_count * 100
df_age_count = df_age_cat_count.rename(columns={'SN':'Total Count'})
df_age_count['Percent of Players'] = df_age_count['Percent of Players'].map("{:.2f}".format)
df_age_count

              Total Count Percent of Players
Age Category
<10                    17               2.95
10-14                  22               3.82
15-19                 107              18.58
20-24                 258              44.79
25-29                  77              13.37
30-34                  52               9.03
35-39                  31               5.38
40+                    12               2.08

# Purchasing Analysis (Age)
* Bin the purchase_data data frame by age
* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below
* Create a summary data frame to hold the results
* Display the summary data frame

In [45]:
# Group by Age Category
df_purchase_group  = df_main.groupby(['Age Category'])

In [46]:
count_age_cat = df_purchase_group.count()
df_age_count = pd.DataFrame(count_age_cat['Age'])

In [47]:
avg_purchase_price = df_purchase_group['Price'].mean()
df_age_avg_price = pd.DataFrame(avg_purchase_price)

In [48]:
sum_purchase_price = df_purchase_group['Price'].sum()
df_age_total = pd.DataFrame(sum_purchase_price)

In [49]:
df_price_age = df_main[['SN','Age Category','Price']]
df_price_age.head()

              SN Age Category  Price
0        Lisim78        20-24   3.53
1    Lisovynya38          40+   1.56
2     Ithergue48        20-24   4.88
3  Chamassasya86        20-24   3.27
4      Iskosia90        20-24   1.44

In [50]:
df_price_age_group = df_price_age.groupby(['Age Category','SN']).sum().dropna()

In [51]:
avg_price_age = df_price_age_group.groupby(['Age Category']).mean()
df_age_avg_total_price = avg_price_age

In [52]:
merge1 = pd.merge(df_age_count,df_age_avg_price,on='Age Category')
merge2 = pd.merge(merge1,df_age_total,on='Age Category')
purchase_analysis = pd.merge(merge2,df_age_avg_total_price,on='Age Category')
df_purchase_analysis = purchase_analysis.rename(columns={'Age':'Purchase Count',
                                     'Price_x':'Average Purchase Price',
                                     'Price_y':'Total Purchase Value',
                                     'Price':'Avg Total Purchase per Person'})
df_purchase_analysis['Average Purchase Price'] = df_purchase_analysis['Average Purchase Price'].map("${:,.2f}".format)
df_purchase_analysis['Total Purchase Value'] = df_purchase_analysis['Total Purchase Value'].map("${:,.2f}".format)
df_purchase_analysis['Avg Total Purchase per Person'] = df_purchase_analysis['Avg Total Purchase per Person'].map("${:,.2f}".format)
df_purchase_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Category,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

# Top Spenders
* Identify the the top 5 spenders in the game by total purchase value, then list (in a table):
    * SN
    * Purchase Count
    * Average Purchase Price
    * Total Purchase Value

In [53]:
sn_group_sum = df_main.groupby(['SN']).sum()
df_total_purchase_value = pd.DataFrame(sn_group_sum['Price'].sort_values(ascending=False).nlargest(n=5))
df_total_purchase_value

             Price
SN
Lisosia93    18.96
Idastidru52  15.45
Chamjask73   13.83
Iral74       13.62
Iskadarya95  13.10

In [54]:
top_spenders_names = list(df_total_purchase_value.index[[0,1,2,3,4]])
top_spenders_names
top_spenders_filter = df_main.loc[df_main['SN'].isin(top_spenders_names)]

In [55]:
sn_group_count = df_main.groupby(['SN']).count()
df_purchase_count = pd.DataFrame(top_spenders_filter.groupby('SN').count()['Price'])
df_purchase_count

             Price
SN
Chamjask73       3
Idastidru52      4
Iral74           4
Iskadarya95      3
Lisosia93        5

In [56]:
df_avg_purchase_price = pd.DataFrame(top_spenders_filter.groupby('SN').mean()['Price'])

In [57]:
top_spenders_sum = pd.DataFrame(top_spenders_filter.groupby('SN').sum()['Price'])
top_spenders_sum

             Price
SN
Chamjask73   13.83
Idastidru52  15.45
Iral74       13.62
Iskadarya95  13.10
Lisosia93    18.96

In [69]:
merge1 = pd.merge(df_purchase_count,df_avg_purchase_price,on='SN')
top_spender = pd.merge(merge1,df_total_purchase_value,on='SN')
df_top_spender = top_spender.rename(columns={'Price_x':'Purchase Count',
                               'Price_y':'Average Purchase Price',
                               'Price':'Total Purchase Value'}
                     )
df_top_spender['Average Purchase Price'] = df_top_spender['Average Purchase Price'].map("${:,.2f}".format)
df_top_spender['Total Purchase Value'] = df_top_spender['Total Purchase Value'].map("${:,.2f}".format)
df_top_spender.sort_values('Total Purchase Value',ascending=False)

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

# Most Popular Items
* Identify the 5 most popular items by purchase count, then list (in a table):
    * Item ID
    * Item Name
    * Purchase Count
    * Item Price
    * Total Purchase Value

In [59]:
df_item = df_main[['Item ID','Item Name','Price']]
item_group = df_item.groupby(['Item ID','Item Name'],as_index=False)
df_top_item_count = item_group.count().nlargest(columns = 'Price', n=5) 
df_top_item_count

     Item ID                                     Item Name  Price
177      178  Oathbreaker, Last Hope of the Breaking Storm     12
81        82                                       Nirvana      9
107      108     Extraction, Quickblade Of Trembling Hands      9
144      145                          Fiery Glass Crusader      9
19        19                 Pursuit, Cudgel of Necromancy      8

In [60]:
item_ids = list(df_top_item_count['Item ID'])
item_sum = item_group.sum()

In [61]:
df_top_item_sum = item_sum.loc[item_sum['Item ID'].isin(item_ids)]
df_top_item_sum

     Item ID                                     Item Name  Price
19        19                 Pursuit, Cudgel of Necromancy   8.16
81        82                                       Nirvana  44.10
107      108     Extraction, Quickblade Of Trembling Hands  31.77
144      145                          Fiery Glass Crusader  41.22
177      178  Oathbreaker, Last Hope of the Breaking Storm  50.76

In [62]:
df_top_item_price = df_item.loc[df_item['Item ID'].isin(item_ids)].drop_duplicates()

In [63]:
merge1 = pd.merge(df_top_item_count,df_top_item_price,on='Item ID')
merge1_clean = merge1[['Item ID','Item Name_x','Price_x','Price_y']].rename(columns={'Item Name_x':'Item Name',
                                                                                     'Price_x':'Purchase Count',
                                                                                     'Price_y':'Item Price'}
                                                                           )
most_popular_item = pd.merge(merge1_clean,df_top_item_sum,on='Item ID')
df_most_popular_item = most_popular_item[['Item ID','Item Name_x','Purchase Count','Item Price','Price']].rename(columns={'Item Name_x':'Item Name',
                                                                                                         'Price':'Total Purchase Value'}
                                                                                               )
df_most_popular_item['Item Price'] = df_most_popular_item['Item Price'].map("${:,.2f}".format)
df_most_popular_item['Total Purchase Value'] = df_most_popular_item['Total Purchase Value'].map("${:,.2f}".format)
df_most_popular_item

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
0,178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
1,82,Nirvana,9,$4.90,$44.10
2,108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
3,145,Fiery Glass Crusader,9,$4.58,$41.22
4,19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

# Most Profitable Items
* Identify the 5 most profitable items by total purchase value, then list (in a table):
    * Item ID
    * Item Name
    * Purchase Count
    * Item Price
    * Total Purchase Value

In [64]:
most_profitable_sum = item_group.sum().nlargest(columns='Price',n=5)
most_profitable_sum

     Item ID                                     Item Name  Price
177      178  Oathbreaker, Last Hope of the Breaking Storm  50.76
81        82                                       Nirvana  44.10
144      145                          Fiery Glass Crusader  41.22
91        92                                  Final Critic  39.04
102      103                                Singed Scalpel  34.80

In [65]:
profitable_item_list = list(most_profitable_sum['Item ID'])
profitable_item_count = item_group.count()
most_profitable_count = profitable_item_count.loc[profitable_item_count['Item ID'].isin(profitable_item_list)]
most_profitable_count

     Item ID                                     Item Name  Price
81        82                                       Nirvana      9
91        92                                  Final Critic      8
102      103                                Singed Scalpel      8
144      145                          Fiery Glass Crusader      9
177      178  Oathbreaker, Last Hope of the Breaking Storm     12

In [66]:
most_profitable_price = df_item.loc[df_item['Item ID'].isin(profitable_item_list)].drop_duplicates()
most_profitable_price

     Item ID                                     Item Name  Price
2         92                                  Final Critic   4.88
18        82                                       Nirvana   4.90
25       178  Oathbreaker, Last Hope of the Breaking Storm   4.23
132      145                          Fiery Glass Crusader   4.58
175      103                                Singed Scalpel   4.35

In [68]:
merge1 = pd.merge(most_profitable_count,most_profitable_price,on='Item ID')
merge1_clean = merge1[['Item ID','Item Name_x','Price_x','Price_y']].rename(columns={'Item Name_x':'Item Name',
                                                                          'Price_x':'Purchase Count',
                                                                          'Price_y':'Item Price'}
                                                                )
merge2 = pd.merge(merge1_clean,most_profitable_sum,on='Item ID')
df_most_profitable_item = merge2[['Item ID','Item Name_x','Purchase Count','Item Price','Price']].rename(columns={'Item Name_x':'Item Name',
                                                                                                                  'Price':'Total Purchase Value'}
                                                                                                        )
df_most_profitable_item['Item Price'] = df_most_profitable_item['Item Price'].map("${:,.2f}".format)
df_most_profitable_item['Total Purchase Value'] = df_most_profitable_item['Total Purchase Value'].map("${:,.2f}".format)
df_most_profitable_item.sort_values('Total Purchase Value',ascending=False)

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
4,178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
0,82,Nirvana,9,$4.90,$44.10
3,145,Fiery Glass Crusader,9,$4.58,$41.22
1,92,Final Critic,8,$4.88,$39.04
2,103,Singed Scalpel,8,$4.35,$34.80